
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Параметры.ТекстПояснения) Тогда
		Элементы.ДекорацияПояснение.Заголовок = Параметры.ТекстПояснения
			+ Символы.ПС + Символы.ПС
			+ НСтр("ru = 'Отсутствует компонента для используемого клиентского приложения.
			       |Обратитесь к администратору.'");

	КонецЕсли;
	
	// Заполнение реквизитов поддерживаемых клиентов.
	Если ТипЗнч(Параметры.ПоддерживаемыеКлиенты) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПоддерживаемыеКлиенты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти