
#Область ОбработчикиПодписокНаСобытия

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "Обработка.НастройкаРезервногоКопированияИБ.Форма.НастройкаРезервногоКопированияКлиентСервер";
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			ВыбраннаяФорма = "Обработка.НастройкаРезервногоКопированияИБ.Форма.НастройкаРезервногоКопирования";
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти