#Область СлужебныеПроцедурыИФункции

Функция КонтактыВзаимодействий() Экспорт

	Результат = Новый Массив();
	
	Контакт = ВзаимодействияКлиентСервер.НовоеОписаниеКонтакта();
	Контакт.Тип = Тип("СправочникСсылка.Пользователи");
	Контакт.Имя = "Пользователи";
	Контакт.Представление = НСтр("ru = 'Пользователи'");
	Контакт.ВозможностьИнтерактивногоСоздания = Ложь;
	Контакт.ИскатьПоДомену = Ложь;
	Результат.Добавить(Контакт);
	
	ВзаимодействияКлиентСерверПереопределяемый.ПриОпределенииВозможныхКонтактов(Результат);
	Возврат Новый ФиксированныйМассив(Результат);

КонецФункции

Функция ПредметыВзаимодействий() Экспорт
	
	Предметы = Новый Массив;
	ВзаимодействияКлиентСерверПереопределяемый.ПриОпределенииВозможныхПредметов(Предметы);
	Возврат Новый ФиксированныйМассив(Предметы);
	
КонецФункции

#КонецОбласти
