#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистем конфигурации.

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы.
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыКлиента.Свойство("Банки") И ПараметрыКлиента.Банки.ВыводитьОповещениеОНеактуальности Тогда
		ПодключитьОбработчикОжидания("РаботаСБанкамиВывестиОповещениеОНеактуальности", 45, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление классификатора банков.

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторУстарел() Экспорт
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Классификатор банков устарел'"),
		НавигационнаяСсылкаФормыЗагрузки(),
		НСтр("ru = 'Обновить классификатор банков'"),
		БиблиотекаКартинок.Предупреждение32);
	
КонецПроцедуры

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторУспешноОбновлен() Экспорт
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Классификатор банков успешно обновлен'"),
		НавигационнаяСсылкаФормыЗагрузки(),
		НСтр("ru = 'Классификатор банков обновлен'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКлассификаторАктуален() Экспорт
	
	ПоказатьПредупреждение(,НСтр("ru = 'Классификатор банков актуален.'"));
	
КонецПроцедуры

// Возвращает навигационную ссылку для оповещений.
//
Функция НавигационнаяСсылкаФормыЗагрузки()
	Возврат "e1cib/data/Обработка.ЗагрузкаКлассификатораБанков.Форма.ЗагрузкаКлассификатора";
КонецФункции

Процедура ОткрытьФормуЗагрузкиКлассификатора(Владелец, ОткрытиеИзСписка = Ложь) Экспорт
	Если ОткрытиеИзСписка Тогда
		ПараметрыФормы = Новый Структура("ОткрытиеИзСписка");
	КонецЕсли;
	ИмяФормы = "Обработка.ЗагрузкаКлассификатораБанков.Форма.ЗагрузкаКлассификатора";
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, Владелец);
КонецПроцедуры

#КонецОбласти
