#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрименитьДляВсех = Параметры.ПрименитьДляВсех;
	ТекстСообщения   = Параметры.ТекстСообщения;
	БазовоеДействие  = Параметры.БазовоеДействие;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьКнопкуУмолчания(БазовоеДействие);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаписатьВыполнить()
	
	СтруктураВозврата = Новый Структура("ПрименитьДляВсех, КодВозврата", 
		ПрименитьДляВсех, КодВозвратаДиалога.Да);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьВыполнить()
	
	СтруктураВозврата = Новый Структура("ПрименитьДляВсех, КодВозврата", 
		ПрименитьДляВсех, КодВозвратаДиалога.Пропустить);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьВыполнить()
	
	СтруктураВозврата = Новый Структура("ПрименитьДляВсех, КодВозврата", 
		ПрименитьДляВсех, КодВозвратаДиалога.Прервать);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьКнопкуУмолчания(ДействиеПоУмолчанию)
	
	Если ДействиеПоУмолчанию = ""
	 Или ДействиеПоУмолчанию = "Пропустить" Тогда
		
		Элементы.Пропустить.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ДействиеПоУмолчанию = "Да" Тогда
		Элементы.Перезаписать.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ДействиеПоУмолчанию = "Прервать" Тогда
		Элементы.Прервать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
