#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(СсылкаВарианта, ПараметрыВыполненияКоманды)
	Вариант = СсылкаВарианта;
	Форма = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Если Форма.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаСписка" Тогда
			Вариант = Форма.Элементы.Список.ТекущиеДанные;
		ИначеЕсли Форма.ИмяФормы = "Справочник.ВариантыОтчетов.Форма.ФормаЭлемента" Тогда
			Вариант = Форма.Объект;
		КонецЕсли;
	Иначе
		Форма = Неопределено;
	КонецЕсли;
	
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Форма, Вариант);
КонецПроцедуры

#КонецОбласти
