#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(МассивРассылок, ПараметрыВыполненияКоманды)
	Если ТипЗнч(МассивРассылок) <> Тип("Массив") ИЛИ МассивРассылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	
	ПараметрыЗапуска = Новый Структура("МассивРассылок, Форма, ЭтоФормаЭлемента");
	ПараметрыЗапуска.МассивРассылок = МассивРассылок;
	ПараметрыЗапуска.Форма = Форма;
	ПараметрыЗапуска.ЭтоФормаЭлемента = (Форма.ИмяФормы = "Справочник.РассылкиОтчетов.Форма.ФормаЭлемента");
	
	РассылкаОтчетовКлиент.ВыполнитьСейчас(ПараметрыЗапуска);
КонецПроцедуры

#КонецОбласти
