#Область ПрограммныйИнтерфейс

// Обработка добавления подсистем
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "ЗадачиНебольшойСтудии";
    Описание.Версия = "1.0.1.1";
	
	// Требуется библиотека стандартных подсистем.
	//
    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры // ПриДобавленииПодсистемы

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры // ПриДобавленииОбработчиковОбновления

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
КонецПроцедуры // ПередОбновлениемИнформационнойБазы

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры // ПослеОбновленияИнформационнойБазы
	
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
КонецПроцедуры // ПриПодготовкеМакетаОписанияОбновлений

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры // ПриОпределенииРежимаОбновленияДанных

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
КонецПроцедуры // ПриЗавершенииПереходаСДругойПрограммы

#КонецОбласти 